# Mac App Store command-line interface (https://github.com/mas-cli/mas)
brew "mas"
# Watch command every X seconds
brew "watch"
# Interactive process viewer dashboard
brew "htop"
# Display directories as trees (https://www.geeksforgeeks.org/tree-command-unixlinux/)
brew "tree"
# Display process as trees (https://www.howtoforge.com/linux-pstree-command/)
brew "pstree"
# Download files over network (https://www.computerhope.com/unix/wget.htm)
brew "wget"
# Tool for managing dock items (https://github.com/chilcote/outset/wiki/Dockutil)
# There has been an delay with pushing the latest version of dockutil
# In case this fails, follow this https://github.com/kcrawford/dockutil/issues/127#issuecomment-1085973552
brew "dockutil"
# Install ZShell (https://sourabhbajaj.com/mac-setup/iTerm/zsh.html)
brew "zsh"
# Install node
brew "node"
# Get lightweight comand line json processor
brew "jq"
# Kubectl utils: prompt & quickly switch contexts
brew "kubectl"
brew "kubectx"
brew "kube-ps1"
brew "minikube"
# GoLang programming language
brew "golang"
# Python 3 version
brew "python3"
# Install OpenAPI generator (Swagger)
brew "openapi-generator"
# Heroku toolkit
brew "heroku"
# For emoji animation on terminal startup
brew "jp2a"
brew "imagemagick"
# For GPG management
brew "gpg"
# Add exercism client
brew "exercism"
# Add aws client app and "aws Authenticator" (useful for work)
brew "awscli"
brew "aws-iam-authenticator"
# ccat is the colorizing cat (https://github.com/owenthereal/ccat)
brew "ccat"
